### Python MySQL

Python needs a MySQL driver to access the MySQL database.

In this tutorial we will use the driver "MySQL Connector"

Create Connection

Start by creating a connection to the database.

Use the username and password from your MySQL database:

In [99]:
import sql_connect

cursor, db =sql_connect.credentials()

Creatting Database

In [100]:
# cursor.execute("CREATE DATABASE fx")

In [101]:
cursor.execute("SHOW DATABASES")
for x in cursor:
    print (x)

('acquilafx',)
('customers',)
('fx',)
('information_schema',)
('kilimo',)
('moviesdb',)
('mysql',)
('performance_schema',)
('sys',)
('tecnobrain',)

## Create Table

In [102]:
# cursor.execute ("USE fx")

In [103]:
# cursor.execute('CREATE TABLE eurusd (name VARCHAR(255), price float(34))')

## Primary Key

When creating a table, you should also create a column with a unique key for each record.

This can be done by defining a PRIMARY KEY.

We use the statement "INT AUTO_INCREMENT PRIMARY KEY" which will insert a unique number for each record. Starting at 1, and increased by one for each record.

In [104]:
# since the table already exist, we use alter table

# cursor.execute("ALTER TABLE EURUSD ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

Insert Into Table

To fill a table in MySQL, use the "INSERT INTO" statement.

Important!: Notice the statement: mydb.commit(). It is required to make the changes, otherwise no changes are made to the table.

In [105]:
# sql="INSERT INTO EURUSD (name, price) VALUES(%s,%s)"
# val= ('used', 2345)
# cursor.execute(sql, val)
# db.commit() # saving the changes

In [106]:
print(cursor.rowcount,"record inserted")

10 record inserted

### Insert Multiple Rows

To insert multiple rows into a table, use the executemany() method.

The second parameter of the executemany() method is a list of tuples, containing the data you want to insert:

In [107]:
# sql= "INSERT INTO EURUSD (name, price) VALUES(%s, %s)"
# val= [('jpy', 2345),
#       ('cad', 3564),
#       ('ksh',130),
#       ('tsh',2456)]
# cursor.executemany(sql,val)
# db.commit()
# cursor.rowcount

### Get Inserted ID

You can get the id of the row you just inserted by asking the cursor object.

Note: If you insert more than one row, the id of the last inserted row is returned.

In [108]:
# sql= "INSERT INTO EURUSD (name, price) VALUES (%s, %s)"
# val= ('ssd', 456)
# cursor.execute(sql, val)
# db.commit()

# print('the row inserted ID IS ', cursor.lastrowid)

### Create Table with no auto primary keys 

1. Manually Assigning a Primary Key

Instead of using AUTO_INCREMENT, you can manually insert unique values
Note: when creating a table, the columns must be declared during creation

In [109]:
# cursor.execute ("CREATE table orders ("
# "order_Id  INT PRIMARY KEY,"
# "product_name VARCHAR (255)"
# ",price INT)")

In [110]:
# cursor.execute("show tables")
# for x in cursor:
#     print (x)

In [111]:
# inserting info in orders table
"INSERT INTO orders (order_id,product_name, price) VALUES (1023, 'bitcoin', 345)"

"INSERT INTO orders (order_id,product_name, price) VALUES (1023, 'bitcoin', 345)"

 ### Using UUID Instead of Integer (For Distributed Systems)
If you need unique IDs across multiple databases, use UUID instead of AUTO_INCREMENT.

Using UUID as a Primary Key in MySQL for Distributed Databases

In distributed systems, UUID (Universally Unique Identifier) is often used as a primary key instead of AUTO_INCREMENT to ensure globally unique IDs across multiple servers.

In [112]:
# cursor.execute ("CREATE TABLE users (user_id CHAR(36) PRIMARY KEY DEFAULT (UUID()), name VARCHAR (255))")

In [113]:
# cursor.execute("INSERT INTO  users (name) VALUES ('thomas')")

In [114]:
cursor.rowcount

10

### MySQL Select From

In [115]:
# cursor.execute("SELECT * FROM eurusd")
# result= cursor.fetchall()

# for x in result:
#     print (x)

In [116]:
cursor.rowcount

10

### Selecting Columns

To select only some of the columns in a table, use the "SELECT" statement followed by the column name(s):

In [117]:
# cursor.execute ("SELECT name FROM eurusd")
# cursor.fetchmany(5)

### Using the fetchone() Method

In [118]:
# cursor.execute("SELECT name FROM eurusd")
# cursor.fetchone()

## MySQL Where

Select With a Filter

When selecting records from a table, you can filter the selection by using the "WHERE" statement:

In [119]:
cursor.execute("use moviesdb")

In [120]:
cursor.execute("SHOW TABLES")
for x in cursor:
    print (x)

('actors',)
('financials',)
('languages',)
('movie_actor',)
('movies',)

In [121]:
cursor.execute("SELECT * FROM actors")
result =cursor.fetchmany(5)

In [124]:
cursor.fetchall() # clearing the the preceeding querry


sql="SELECT * FROM actors WHERE birth_year > 1990"
cursor. execute (sql)
result =cursor.fetchall()
for x in result:
    print (x)

(152, 'Darsheel Safary', 1997)
(170, 'Kiara Advani', 1991)

In [ ]:
cursor.description

[('actor_id', 3, None, None, None, None, 0, 16931, 63),
 ('name', 253, None, None, None, None, 0, 4097, 45),
 ('birth_year', 13, None, None, None, None, 1, 96, 63)]

### Wildcard Characters

You can also select the records that starts, includes, or ends with a given letter or phrase.

Use the %  to represent wildcard characters:

Names starting with "A"

In [130]:
cursor.fetchall()

sql= "SELECT * FROM actors WHERE name LIKE '%s'"
cursor.execute(sql)
cursor.fetchall()

[(67, 'Tim Robbins', 1958),
 (95, 'Chris Evans', 1981),
 (160, 'Prabhas', 1979),
 (166, 'Tommy Lee Jones', 1946)]


Names ending  with "A"

In [131]:
cursor.fetchall()

sql= "SELECT * FROM actors WHERE name LIKE 's%'"
cursor.execute(sql)
cursor.fetchall()

[(51, 'Sanjay Dutt', 1959),
 (59, 'Shah Rukh Khan', 1965),
 (63, 'Sharman Joshi', 1979),
 (82, 'Sam Worthington', 1976),
 (90, 'Sam Neill', 1947),
 (92, 'Song Kang-ho', 1967),
 (153, 'Sunil Dutt', 1929),
 (164, 'Salman Khan', 1965),
 (167, 'Sebastian Stan', 1982),
 (169, 'Sidharth Malhotra', 1985)]

Names containing "sa" anywhere

In [132]:
cursor.fetchall()

sql= "SELECT * FROM actors WHERE name LIKE '%sa%'"
cursor.execute(sql)
cursor.fetchall()

[(51, 'Sanjay Dutt', 1959),
 (82, 'Sam Worthington', 1976),
 (83, 'Zoe Saldana', 1978),
 (90, 'Sam Neill', 1947),
 (152, 'Darsheel Safary', 1997),
 (164, 'Salman Khan', 1965)]

### MySQL Order By

Sort the Result

Use the ORDER BY statement to sort the result in ascending or descending order.

The ORDER BY keyword sorts the result ascending by default. To sort the result in descending order, use the DESC keyword.

Example

In [134]:
cursor.fetchall()

cursor.execute("SELECT * FROM actors ORDER BY name")
cursor.fetchmany(5)

[(61, 'Aamir Khan', 1965),
 (85, 'Al Pacino', 1940),
 (156, 'Allu Arjun', 1982),
 (57, 'Amitabh Bachchan', 1942),
 (168, 'Anil Kapoor', 1956)]

In [135]:
cursor.fetchall()

cursor.execute("SELECT * FROM actors ORDER BY name DESC")
cursor.fetchmany(5)

[(83, 'Zoe Saldana', 1978),
 (50, 'Yash', 1986),
 (75, 'Will Smith', 1968),
 (166, 'Tommy Lee Jones', 1946),
 (56, 'Tom Hiddleston', 1981)]